part of 'library.dart';

const String changelogString = //
    '''Версия 0.2.3:
- Переделана система навигации приложения
- Добавлена возможность выбора начальной страницы в настройках
- Изменён дизайн страницы настроек
- Переделана загрузка постов в ленте
- Добавлена подгрузка изображений для начальных экранов
- Добавлена возможность автозаполнения пароля (работает не на всех устройствах)
- Незначительно изменён дизайн экрана авторизации
- Исправлен баг с очисткой кэша
- Добавлена возможность скачать файл в ленте по-новой при удержании пальца на названии файла
Версия 0.2.2 bugfix 1:
- Исправлен баг с историей поиска в расписании
- Исправлена ошибка с TLS сертификатами Портала
Версия 0.2.2:
- Добавлена зачётная книжка
- Добавлена возможность поставить реакцию к посту
- Исправлены некоторые баги''';
