// SPDX-License-Identifier: Apache-2.0
// Copyright 2025 BitCodersNN

const String changelogString = //
    '''[SIZE=18pt][B]Версия 0.5.3:[/B][/SIZE]
- Улучшена производительность ленты
- Исправлен баг с всегда видимой планкой "непрочитанные сообщения"
- Исправлен баг с дублированием сообщений при обновлении чата
- В настройках теперь отображается версия приложения
[SIZE=18pt][B]Версия 0.5.2:[/B][/SIZE]
- Теперь в диалогах отображаются непрочитанные сообщения
- Теперь при открытом чате список чатов тоже обновляется
- Исправлен баг с пролистыванием сообщений в чатах
- Исправлены скачки при подгрузке постов в ленте
- В чатах исправлен тип текстового поля - теперь можно писать многострочный текст
- В ленте исправлены баги с загрузкой профилей у постов
- В ленте посты теперь по умолчанию свёрнуты и есть возможность их развернуть, чтобы увидеть полный текст
[SIZE=18pt][B]Версия 0.5.1:[/B][/SIZE]
- Исправлена интенсивность вибрации в разделе чатов
- Исправлено отображение загрузочных экранов приложения
[SIZE=18pt][B]Версия 0.5.0:[/B][/SIZE]
- Добавлен раздел чатов! УРА!
- Исправлены некоторые незначительные баги в ленте
- Теперь картинки у постов в ленте отображаются коллажем, а не просто подряд, как раньше
- Добавлена возможность поделиться постом в ленте
- Теперь приложение распространяется под лицензией Apache-2.0. Условия лицензии можно прочитать [URL=https://github.com/BitCodersNN/unn-mobile?tab=Apache-2.0-1-ov-file]у нас в GitHub[/URL]
[SIZE=18pt][B]Версия 0.4.0:[/B][/SIZE]
- Добавлена вкладка "Материалы"
- Изменена страница "О нас"
- Улучшен выбор места для скачивания справок и материалов
- Теперь можно убрать сообщение, показываемое после экспорта расписания 
- Исправлен баг со скачиванием файла справки вместо её подписи
- Исправлен баг с лишним отступом при отображении сохранённых постов в ленте
- Убрана подсветка новых постов в ленте
[SIZE=18pt][B]Версия 0.3.0:[/B][/SIZE]
- Добавлена страница для получения справок онлайн
- Улучшено отображение постов в ленте! Теперь картинки отображаются сразу
- Теперь в ленте отображаются закреплённые и важные посты!
  Список всех важных постов можно открыть через меню сверху на экране ленты
[SIZE=18pt][B]Версия 0.2.4:[/B][/SIZE]
- Исправлены некоторые баги в боковом меню
- Исправлен баг с зачёткой у первокурсников
- Улучшено определение статуса офлайн
- Добавлен оверлей при офлайне вместо диалоговых окон
- При переходе между экранами их состояние больше не теряется
- Исправлены баги с бесконечной загрузкой расписания
- Исправлен баг с форматом даты после изменений на портале
- Улучшения внутренней части приложения
- Незначительные изменения интерфейса
[SIZE=18pt][B]Версия 0.2.3:[/B][/SIZE]
- Переделана система навигации приложения
- Добавлена возможность выбора начальной страницы в настройках
- Изменён дизайн страницы настроек
- Переделана загрузка постов в ленте
- Добавлена подгрузка изображений для начальных экранов
- Добавлена возможность автозаполнения пароля (работает не на всех устройствах)
- Незначительно изменён дизайн экрана авторизации
- Исправлен баг с очисткой кэша
- Добавлена возможность скачать файл в ленте по-новой при удержании пальца на названии файла
[SIZE=18pt][B]Версия 0.2.2 bugfix 1:[/B][/SIZE]
- Исправлен баг с историей поиска в расписании
- Исправлена ошибка с TLS сертификатами Портала
[SIZE=18pt][B]Версия 0.2.2:[/B][/SIZE]
- Добавлена зачётная книжка
- Добавлена возможность поставить реакцию к посту
- Исправлены некоторые баги''';
