const String changelogString = //
    '''Версия 0.4.0:
- Исправлен баг со скачиванием файла справки вместо её подписи
- Исправлен баг с лишним отступом при отображении сохранённых постов в ленте
- Убрана подсветка новых постов в ленте
Версия 0.3.0:
- Добавлена страница для получения справок онлайн
- Улучшено отображение постов в ленте! Теперь картинки отображаются сразу
- Теперь в ленте отображаются закреплённые и важные посты!
  Список всех важных постов можно открыть через меню сверху на экране ленты
Версия 0.2.4:
- Исправлены некоторые баги в боковом меню
- Исправлен баг с зачёткой у первокурсников
- Улучшено определение статуса офлайн
- Добавлен оверлей при офлайне вместо диалоговых окон
- При переходе между экранами их состояние больше не теряется
- Исправлены баги с бесконечной загрузкой расписания
- Исправлен баг с форматом даты после изменений на портале
- Улучшения внутренней части приложения
- Незначительные изменения интерфейса
Версия 0.2.3:
- Переделана система навигации приложения
- Добавлена возможность выбора начальной страницы в настройках
- Изменён дизайн страницы настроек
- Переделана загрузка постов в ленте
- Добавлена подгрузка изображений для начальных экранов
- Добавлена возможность автозаполнения пароля (работает не на всех устройствах)
- Незначительно изменён дизайн экрана авторизации
- Исправлен баг с очисткой кэша
- Добавлена возможность скачать файл в ленте по-новой при удержании пальца на названии файла
Версия 0.2.2 bugfix 1:
- Исправлен баг с историей поиска в расписании
- Исправлена ошибка с TLS сертификатами Портала
Версия 0.2.2:
- Добавлена зачётная книжка
- Добавлена возможность поставить реакцию к посту
- Исправлены некоторые баги''';
